[
    {
        "id": 110,
        "user_id": 1,
        "r_name": "Banana Bread",
        "cat_id": 16,
        "shared": true,
        "rating": 4,
        "category": "Baked Goods",
        "ingredients": [
            "3 large ripe bananas",
            "1 cup sugar",
            "1 egg",
            "4 tablespoons butter or margarine melted and cooled",
            "1 1\/2 cups all-purpose flour",
            "1 teaspoon each - salt and baking soda"
        ],
        "steps": [
            "Preheat oven to 325 degrees. Lightly grease 9\" x 5\" loaf pan. ",
            "In first bowl, mash bananas. Beat in sugar, then egg and butter. ",
            "In another bowl stir together flour, salt and baking soda. Add banana mixture and stir just until all flour is moistened. ",
            "Pour batter into prepared pan. Bake for 55 to 60 minutes until bread begins to pull away from sides and pick in center comes out clean."
        ],
        "comments": [
            {
                "comment": "Wow - that's the best ever!",
                "user": "John1"
            },
            {
                "comment": "cool beans",
                "user": "John1"
            },
            {
                "comment": "mmmmmm.",
                "user": "John1"
            },
            {
                "comment": "I like to use all whole wheat flour and add 10 minutes to bake time.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 85,
        "user_id": 1,
        "r_name": "Chicken Soup with Rice",
        "cat_id": 9,
        "shared": true,
        "rating": 4,
        "category": "Soup",
        "ingredients": [
            "1 (4-pound) chicken",
            "1 large Anaheim chili, seeded and sliced",
            "3-4 large carrots",
            "1 celery heart (approx. 2 cups)",
            "1\/2 cup long-grain rice",
            "1 medium onion, peeled and sliced",
            "2 tablespoons salt",
            "2 bay leaves",
            "8 cups water"
        ],
        "steps": [
            "In a soup pot over high heat, bring the chicken, water, salt and bay leaves to a boil. Reduce heat to low, cover and simmer 45 minutes.",
            "With a sturdy pair of tongs, pull the chicken out of the pot and put it in a bowl. Gently break the chicken into three or four pieces and allow it to cool.",
            "Meanwhile, put the onion, celery, carrots, chili pepper and rice into the broth in which the chicken was cooked. When the chicken is cool enough to handle pull of all the meat and put it back in the pot with the broth and vegetables. Simmer the soup genttly for 30 to 45 minutes, or until the rice is very tender. Serve hot with Homemade Tortillas."
        ],
        "comments": [
            {
                "comment": "cool",
                "user": "kev"
            },
            {
                "comment": "Sometimes we use two Anaheim chilis instead of one.",
                "user": "John1"
            },
            {
                "comment": "We probably make this about once every two weeks. It's very good.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 119,
        "user_id": 1,
        "r_name": "Chipotle Black Bean & Yam Stew with Cilantro Cabbage Slaw",
        "cat_id": 15,
        "shared": false,
        "rating": 4,
        "category": "Entree",
        "ingredients": [
            "2 tablespoons extra virgin olive oil",
            "1 medium yellow onion, chopped",
            "2 teaspoons ground cumin",
            "1\/2 teaspoon dried oregano (Sara added 1 tsp)",
            "1\/2 teaspoon chipotle chili powder (Sara added 1 tsp)",
            "2 to 3 teaspoons Herbamare or sea salt",
            "2 medium yams, peeled and diced (about 4 cups)",
            "4 cloves garlic, crushed",
            "6 cups cooked black beans",
            "4 cups water or bean cooking liquid",
            "1 medium red bell pepper, diced",
            "the juice of one lime (about 2 to 3 tablespoons)"
        ],
        "steps": [
            "Heat a large 6 or 8-quart pot over medium heat. Add olive oil then add\r\nonions and saute for 5 to 7 minutes. I usually like to add a few\r\ndashes of salt at this point.",
            "Then add the spices, Herbamare, yams, and garlic and saute a minute or\r\ntwo more. Add the black beans and water (or bean cooking liquid). I\r\nalways prefer to use mainly bean cooking liquid. Simmer uncovered for\r\n10 to 15 minutes or until yams are barely tender but not yet cooked.",
            "Timing will depend on what size you dice your yams.",
            "Then add the diced peppers and simmer for 10 minutes more. Taste and\r\nadjust salt and spices if necessary. Remove from heat and add lime\r\njuice.",
            "*From Whole Life Kitchen Blog"
        ],
        "comments": [
            {
                "comment": "Hey, this is a really great dish. The yams are smooth and I like the heat!",
                "user": "John1"
            }
        ]
    },
    {
        "id": 65,
        "user_id": 1,
        "r_name": "Chocolate Chip Cookies",
        "cat_id": 1,
        "shared": false,
        "rating": 4,
        "category": "Cookies",
        "ingredients": [
            "3\/4 cup packed brown sugar",
            "1 tsp. vanilla extract",
            "2 large eggs",
            "2 cups semi-sweet chocolate chips",
            "1 cup chopped nuts",
            "2 1\/4 cups all-purpose flour",
            "1 tsp. baking soda",
            "1 tsp. salt",
            "1 cup (2 sticks) butter or margarine softened",
            "3\/4 cup granulated sugar"
        ],
        "steps": [
            "Combine flour, baking soda and salt in a small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs on at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto un-greased baking sheets.",
            "Preheat oven to 375F.",
            "Bake for 9-11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely.",
            "Makes about 5 dozen Cookies<\/strong>"
        ],
        "comments": [
            {
                "comment": "ye ha!",
                "user": "John1"
            },
            {
                "comment": "mmmmm.",
                "user": "John1"
            },
            {
                "comment": "I really like to use whole wheat four.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 124,
        "user_id": 1,
        "r_name": "Easy Cranberry and Apple Cake",
        "cat_id": 3,
        "shared": false,
        "rating": 4,
        "category": "Deserts",
        "ingredients": [
            "12 oz fresh cranberries, rinsed and picked over for stems",
            "1 Granny Smith apple, peeled, cored and diced",
            "1\/2 cup light brown sugar, lightly packed",
            "1 tablespoon grated orange zest (2 oranges)",
            "1\/4 cup freshly squeezed orange juice",
            "1\/ 1\/8 teaspoons ground cinnamon, divided",
            "2 extra-large eggs, at room temperature",
            "1 cup plus 1 tablespoon granulated sugar",
            "1\/4 pound (1 stick) unsalted butter, melted and slightly cooled",
            "1 teaspoon pure vanilla extract",
            "1\/4 cup sour cream",
            "1 cup all-purpose flour",
            "1\/4 teaspoon kosher salt"
        ],
        "steps": [
            "Preheat the oven to 325 degrees F.",
            "Combine the cranberries, apple, brown sugar, orange zest, orange juice, and 1 teaspoon of the cinnamon in a medium bowl. Set aside.",
            "In the bowl of an electric mixer fitted with the paddle attachment, beat the eggs on medium-high speed for 2 minutes. With the mixer on medium, add 1 cup of the granulated sugar, the butter, vanilla, and sour cream and beat just until combined. On low speed, slowly add the flour and salt.",
            "Pour the fruit mixture evenly into a 10-inch glass pie plate. Pour the batter over the fruit, covering it completely. Combine the remaining 1 tablespoon of granulated sugar and 1\/8 teaspoon of cinnamon and sprinkle it over the batter. Bake for 55 to 60 minutes, until a toothpick inserted in the middle of the cake comes out clean and the fruit is bubbling around the edges. Serve warm or at room temperature.",
            "Serve with whipped creme (flavored with amaretto)"
        ],
        "comments": [
            {
                "comment": "This might also work well with pear instead of apple",
                "user": "John1"
            }
        ]
    },
    {
        "id": 113,
        "user_id": 1,
        "r_name": "German Chocolate Cake",
        "cat_id": 14,
        "shared": true,
        "rating": 4,
        "category": "Cakes",
        "ingredients": [
            "1 package (4 ounces) ",
            "BAKER'S® GERMAN'S® sweet chocolate",
            "1\/2 cup water",
            "2 cups flour",
            "1 teaspoon baking soda",
            "1\/4 teaspoon salt",
            " * 1 cup (2 sticks) margarine or butter, softened",
            "2 cups sugar",
            "4 egg yolks",
            "1 teaspoon vanilla",
            "1 cup buttermilk",
            "4 egg whites"
        ],
        "steps": [
            "Heat oven to 350F. Line bottoms of 3 (9-inch) round cake pans with wax paper",
            "Microwave chocolate and water in large microwavable bowl on HIGH 1 1\/2 to 2 minutes until chocolate is almost melted, stirring halfway through heating time. Stir until chocolate is completely melted *",
            "Mix flour, baking soda and salt; set aside. Beat margarine and sugar in large bowl with electric mixer on medium speed until light and fluffy. Add egg yolks, 1 at a time, beating well after each addition. Stir in chocolate mixture and vanilla. Add flour mixture alternately with buttermilk, beating after each addition until smooth.",
            "Beat egg whites in another large bowl with electric mixer on high speed until stiff peaks form. Gently stir into batter. Pour into prepared pans. Bake 30 minutes or until cake springs back when lightly touched in center. Immediate run spatula between cakes and sides of pans. Cool 15 minutes; remove from pans. Remove wax paper. Cool completely on wire racks.",
            "Spread Coconut-Pecan Frosting between layers and over top of cake. Makes 12 servings.",
            "*Top of stove preparation: Heat chocolate and water in heavy 1-quart saucepan on very low heat, stirring constantly until chocolate is melted and mixture is smooth. Remove from heat. Continue as above."
        ],
        "comments": [
            {
                "comment": "Also see frosting.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 70,
        "user_id": 1,
        "r_name": "German Chocolate Cake (frosting)",
        "cat_id": 14,
        "shared": true,
        "rating": 4,
        "category": "Cakes",
        "ingredients": [
            "1\/2 teaspoons vanilla",
            "4 egg yolks, slightly beaten",
            "3\/4 cup (1 1\/2 sticks) margarine or butter",
            "1 1\/2 cups sugar",
            "1 can (12 ounces) evaporated milk",
            "1 package (7 ounces) Bakers Angel Flake Coconut (about 2 2\/3 cups) ",
            "1 1\/2 cups chopped pecans"
        ],
        "steps": [
            "Mix milk, sugar, margarine, egg yolks and vanilla in large saucepan. Cook and stir on medium heat about 12 minutes or until thickened and golden brown. Remove from heat.",
            "Stir in coconut and pecans. Cool to room temperature and of spreading consistency.",
            "Makes about 4 1\/2 cups"
        ],
        "comments": [
            {
                "comment": "mmmmm.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 88,
        "user_id": 1,
        "r_name": "Pizza Dough",
        "cat_id": 56,
        "shared": true,
        "rating": 4,
        "category": "Italian",
        "ingredients": [
            "3 1\/4 cups of flour",
            "3 tablespoons of olive oil",
            "1\/2 teaspoon salt",
            "1 teaspoon sugar",
            "1 package of yeast"
        ],
        "steps": [
            "Scatter your favorite toppings over the surface and bake at 400 degrees for 15 minutes. Cut into 8 pieces.",
            "Dissolve 1 package of yeast in 1\/4 cup warm water for 10 minutes. Mix the following: 1\/2 teaspoon of salt, 1 teaspoon of sugar, 3 tablespoons of olive oil, one cup of cool water and pour into mount of 3 1\/4 cups of flour along with dissolved yeast. Knead on a flat surface until elastic and smooth. If you're using a food processor, pulse until the dough forms a ball then remove and knead by hand. Place dough in a buttered and floured bowl and let rest for 30 minutes. Roll into 1 large or 2 smaller circles and brush with oil."
        ],
        "comments": [
            {
                "comment": "yeah!",
                "user": "John1"
            },
            {
                "comment": "Best to make this in the morning and let it rest.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 98,
        "user_id": 1,
        "r_name": "Pumpkin Bread",
        "cat_id": 16,
        "shared": true,
        "rating": 4,
        "category": "Baked Goods",
        "ingredients": [
            "3 cups sugar",
            "3 1\/2 cups all-purpose flour",
            "1\/2 cup vegetable oil",
            "4 eggs",
            "1 1\/2 tsp salt",
            "1 tsp cinnamon",
            "1 tsp nutmeg (I always use freshly-grated nutmeg -- I don't want to be a snob about it, but it makes a big difference!)",
            "1\/2 tsp allspice",
            "2 tsp baking soda",
            "1\/2 tsp baking powder",
            "1\/2 tsp vanilla",
            "1 15-oz can of pumpkin (NOT pumpkin pie filling)",
            "2\/3 cup water",
            "Cinnamon-sugar (optional - 2-3 Tbsp)"
        ],
        "steps": [
            "Preheat oven to 350 degrees.",
            "Grease 2 loaf pans (or 2 muffin tins) and coat with cinnamon-sugar.",
            "In a large bowl, mix all ingredients together thoroughly (a whisk will be fine -- you don't need a mixer). There will still be a few lumps.\r\n",
            "Divide batter between pans. Bake at 350 for 50-60 minutes, until a toothpick inserted into the center comes out clean. Let cool in pans for 10-15 minutes, then turn out onto a rack.",
            "source: sugarandwool.com\/2009_05_01_archive.html"
        ],
        "comments": []
    },
    {
        "id": 93,
        "user_id": 1,
        "r_name": "Shredded Carrot Salad",
        "cat_id": 17,
        "shared": true,
        "rating": 4,
        "category": "Salad",
        "ingredients": [
            "5 to 6 medium carrots",
            "1\/2 teasp. salt",
            "6 tablesp. olive oil",
            "1 tablesp. lemon juice"
        ],
        "steps": [
            "The clean, simple and surprisingly refreshing taste of this salad makes it good after the carbonara. Serves 4",
            "Peel and wash the carrots and grate them on largest holes of the grater.",
            "Just before serving, add the salt, lemon juice and olive oil. Toss well and serve at once."
        ],
        "comments": [
            {
                "comment": "This is a very nice side salad.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 72,
        "user_id": 1,
        "r_name": "Split Pea Soup",
        "cat_id": 9,
        "shared": true,
        "rating": 4,
        "category": "Soup",
        "ingredients": [
            "2 3\/4 cups water",
            "1 1\/2 cups dry split peas, rinsed and drained",
            "1 14 ounce can reduced-sodium chicken broth",
            "1 to 1 1\/2 pounds meaty smoked pork hocks or one 1 to 1 1\/2 pound meaty ham bone",
            "teaspoon dried marjoram, crushed\r\n",
            "dash black pepper",
            "1 bay leaf",
            "1\/2 cup chopped carrot (1 medium)",
            "1\/2 cup chopped celery (1 stalk)",
            "1\/2 cup chopped onion (1 medium)"
        ],
        "steps": [
            "In a large saucepan combine water, split peas, chicken broth, pork hocks, marjoram, pepper, and bay leaf. Bring to boiling; reduce heat. Simmer, covered, for I hour, stirring occasionally. Remove pork hocks. When cool enough to handle, cut meat off bones; coarsely chop meat. Discard bones. Return meat to saucepan. Stir in carrot, celery, and onion. Return to boiling; reduce heat. Simmer, covered, for 20 to 30 minutes more or until vegetables are tender. Discard bay leaf.",
            "Crockery-cooker directions: In a 3 1\/2 or 4 quart crockery cooker combine split peas, pork hocks, marjoram, pepper, bay leaf, canot, celery, and onion. Pour water and chicken broth over all. Cover and cook on low-heat setting for 8 to 10 lamb and Orzo Soup 10 hours or on high-heat setting for 4 to 5 hours. Discard bay leaf. Remove pork hocks; coarsely chop meat. Stir meat into soup."
        ],
        "comments": []
    },
    {
        "id": 122,
        "user_id": 1,
        "r_name": "TUSCAN WHITE BEAN SOUP, 2 WAYS\r\n",
        "cat_id": 15,
        "shared": false,
        "rating": 4,
        "category": "Entree",
        "ingredients": [
            "2 cans of cannellini white beans\r\n4 slices of bacon (I used Applewood-smoked)\r\n",
            "1 onion, diced",
            "1 celery, diced\r\n",
            "2 cloves of garlic, sliced\r\n",
            "4 sage leaves or thyme",
            "2 quarts of low-sodium chicken stock\r\n",
            "1 tsp. olive oil",
            "salt + pepper",
            "Garnish\r\ngarlic croutons\r\nshaved parmesan cheese\r\ncrusty sourdough bread\r\n",
            "1 zucchini chopped "
        ],
        "steps": [
            "* Soak the beans overnight before you begin.",
            "To soak, place the beans into a large bowl and cover with water. Soak overnight.\r\n",
            "In a heavy bottom pot, warm the olive oil over moderate heat. Roughly chop the bacon and add to the pot. Saute until lightly golden.",
            "Tilt the pot, and remove most of the residual oil with a spoon.\r\n",
            "Drain the beans and add to the pot.\r\n",
            "Cover with 1 quart of chicken stock and bring to a gentle boil. Reduce the heat, and simmer until the beans are tender about 1- 1½ hours. Season with salt and pepper.\r\n",
            "For the creamy version, remove half of the soup (with a portion of bacon and sage) and transfer to a blender. Vent the lid and puree in batches. Add additional chicken stock if it's too thick. Alternatively, use a hand held immersion blender. Garnish with parmesan cheese and croutons.",
            "For the chunky version, adjust with salt and pepper to taste, and more stock if needed.\r\n",
            "Serve warm with crusty sourdough bread."
        ],
        "comments": [
            {
                "comment": "Yea this was good but might not need 4 strips of bacon ",
                "user": "John1"
            }
        ]
    },
    {
        "id": 111,
        "user_id": 1,
        "r_name": "Blueberry Muffins",
        "cat_id": 16,
        "shared": true,
        "rating": 3,
        "category": "Baked Goods",
        "ingredients": [
            "1\/2 teaspoon nutmeg",
            "1 teaspoon baking powder",
            "1\/2 cup sugar",
            "1 tablespoon plus 1 and 3\/4 cups flour, divided",
            "1 cup fresh or frozen blueberries*",
            "1\/2 teaspoon cinnamon",
            "3\/4 teaspoon salt",
            "1 egg",
            "1 cup sour cream",
            "1\/3 cup milk"
        ],
        "steps": [
            "* Tip - Baking with Frozen blueberries - when baking, lightly dust the unthawed blueberries with flour immediately before stirring them into the batter.",
            "Preheat oven to 380 degrees. Grease twelve 2 1\/2 inch muffin cups. In a small bowl, toss blueberries with the 1 tablespoon of the flour; set aside. In a large bowl, combine the 1 3\/4 cups flour, the sugar, baking powder, baking soda, nutmeg and salt; set aside. In a medium bowl, beat egg; stir in sour cream and milk; stir into flour mixture until just combined (batter will be lumpy). Stir in reserved blueberries just until evenly distributed. Fill muffin cups 2\/3 full with batter. Bake until golden about 25-30 minutes.\r\nYield: 12 muffins"
        ],
        "comments": [
            {
                "comment": "weird",
                "user": "John1"
            },
            {
                "comment": "I think the tip has something to do with it freezing the batter.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 112,
        "user_id": 1,
        "r_name": "Chinese Pasta Salad",
        "cat_id": 17,
        "shared": false,
        "rating": 3,
        "category": "Salad",
        "ingredients": [
            "Salad",
            "Vermicelli",
            "Green Onions",
            "Red Pepper For Color",
            "Diced Chicken or Pork (Optional)",
            "Toasted Sesame Seeds",
            "Dressing",
            "Balsamic Vinegar",
            "Sugar",
            "Sesame Oil",
            "Chili Oil",
            "Soy Sauce"
        ],
        "steps": [
            "I can't remember the ratio of the above, so I just go by taste. I don't like too strong of sesame taste so I lighten it with a little vegetable oil. The chili oil is also by taste. This salad is best made a day ahead."
        ],
        "comments": []
    },
    {
        "id": 73,
        "user_id": 1,
        "r_name": "Curried Couscous Salad",
        "cat_id": 17,
        "shared": true,
        "rating": 3,
        "category": "Salad",
        "ingredients": [
            "1 tsp fresh ground pepper",
            "1\/2 tsp grated carrots (or finely chopped)",
            "1\/2 cup minced parsley (Italian Flat leaf works well)",
            "1\/2 cup dried currants (or dried cranberries)",
            "1\/4 cup sliced blanched almonds",
            "2 scallions, thinly sliced",
            "1\/4 cup diced red onions",
            "1 1\/2 cups couscous",
            "1 tbsp unsalted butter",
            "1 1\/2 cups boiling water",
            "1\/4 cup plain yogurt",
            "1\/4 cup olive oil",
            "1 tsp white wine vinegar",
            "1 tsp curry powder",
            "1\/4 tsp ground turmeric",
            "1 1\/2 tsp kosher salt"
        ],
        "steps": [
            "Pour couscous in a large bowl, melt butter in the boiling water and pour over couscous.",
            "Cover tightly and set aside for 5 minutes. In a medium bowl, whisk together the yogurt, olive oil, vinegar, curry powder, turmeric, salt and pepper. Fluff the couscous with a fork and pour the curry mixture on top, mixing well. Add the carrots, parsley, currants, almonds, scallions, and red onions. Mix well and adjust seasonings. Chill for a few hours.",
            "Comments: Great summer salad and super easy! From Ina Garten, Barefoot Contessa Cookbook. Salad accompanies well with grilled chicken marinated in lemon, olive oil and thyme - Serves 6"
        ],
        "comments": [
            {
                "comment": "Easy",
                "user": "John1"
            },
            {
                "comment": "Nice ",
                "user": "John1"
            },
            {
                "comment": "Very",
                "user": "John1"
            },
            {
                "comment": "Test",
                "user": "John1"
            }
        ]
    },
    {
        "id": 126,
        "user_id": 1,
        "r_name": "Hard-Boiled Eggs",
        "cat_id": 18,
        "shared": false,
        "rating": 3,
        "category": "Side Dish",
        "ingredients": [
            "4 large eggs"
        ],
        "steps": [
            "Although the term \"hard-boiled\" is more commonly known, \"hard-cooked\" is more accurate because the eggs should not be cooked at a boil. Foolproof Hard-Cooked Eggs Serves 4; Prep time: 15 minutes; Total time: 15 minutes",
            "Place 4 large eggs in a saucepan, and add enough water to cover them by 1 inch. Bring water to a simmer over high heat. Remove from heat, cover, and let stand 12 minutes.",
            "Drain and rinse under cold running water. Unpeeled eggs can be kept in the refrigerator for up to 1 week."
        ],
        "comments": [
            {
                "comment": "This isn't really a recipe :)",
                "user": "John1"
            }
        ]
    },
    {
        "id": 99,
        "user_id": 1,
        "r_name": "Mock Mince Pie",
        "cat_id": 59,
        "shared": true,
        "rating": 3,
        "category": "Pies",
        "ingredients": [
            "9\" pie crust top and bottom",
            "In a bowl mix...",
            "1 1\/3 cup sugar",
            "1\/2 tsp. salt",
            "1\/2 tsp. cinnamon",
            "1\/4 tsp. clove",
            "1\/4 tsp. ginger",
            "1 1\/2 cup pared finely apple (golden)",
            "1 cup raisins",
            "1\/2 cup canned jellied cranberry sauce",
            "1\/3 cup coarsely chopped walnuts",
            "1 tsp orange peal grated",
            "1\/2 tsp. lemon peal grated",
            "1\/4 cup lemon juice"
        ],
        "steps": [
            "Mix well. Line pastry in pan 9\". Put filling in and dot with 1tbsp. butter. Put pie crust top on - slits. Bake at 400 degrees for 30 - 35 minutes."
        ],
        "comments": []
    },
    {
        "id": 92,
        "user_id": 1,
        "r_name": "Peanut Butter-Oatmeal Rounds\r\n",
        "cat_id": 1,
        "shared": true,
        "rating": 3,
        "category": "Cookies",
        "ingredients": [
            "3\/4 cup butter, softened",
            "1\/2 cup peanut butter",
            "1 cup granulated sugar",
            "1\/2 cup packed brown sugar",
            "1 teaspoon baking powder",
            "1\/2 teaspoon baking soda",
            "2 eggs",
            "1 teaspoon vanilla",
            "1 1\/4 cups all-purpose flour",
            "2 cups rolled oats 1 cup chopped ",
            "cocktail peanuts or semisweet ",
            "chocolate pieces"
        ],
        "steps": [
            "Prep: 30 minutes Bake: 10 minutes per batch Oven: 375°F Makes: about 48 cookies",
            "In a large mixing bowt beat butter and peanut butter with an electric mixer on medium to high speed about 30 seconds or until combined. Add granulated sugar, brown sugar, baking powder, and baking soda. Beat until combined, scraping sides of bowl occasionally. Beat in eggs and vanilla until combined. Beat in as much of the flour as you can with the mixer. Stir in any remaining flour. Stir in rolled oats and peanuts.",
            "Drop dough by rounded teaspoons 2 inches apart onto an ungreased cookie sheet. Bake in a 375°F oven about 10 minutes or until edges are lightly browned. Transfer cookies to wire rack and let cool. Chocolate-Peanut Butter-Oatmeal Rounds: Prepare as above, except melt and cool 3 ounces unsweetened chocolate. After beating in eggs and vanilla, stir in chocolate. Bake in a 375°F oven about 10 minutes or until edges are set."
        ],
        "comments": [
            {
                "comment": "hmmmm. going to try this tonight. Word.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 109,
        "user_id": 1,
        "r_name": "Pumpkin Pie with Maple Cream",
        "cat_id": 3,
        "shared": true,
        "rating": 3,
        "category": "Deserts",
        "ingredients": [
            "Crust:\r\n",
            "2 1\/2 cups unsifted all-purpose flour",
            "2 tablespoons granulated sugar",
            "1\/2 teaspoon salt",
            "10 tablespoons cold unsalted butter, cut into small pieces",
            "3 tablespoons cold shortening",
            "one large egg yolk",
            "1 tablespoon fresh lemon juice or white vinegar",
            "3 to 4 tablespoons ice water, or as needed",
            "Nonstick cooking spray",
            "1 egg white whisked together with 1 tablespoon water (reserve egg yolk for filling)",
            "Filling:",
            "2 large eggs plus reserved yolk",
            "3\/4 cup granulated maple sugar (see note)",
            "2 tablespoons granulated sugar",
            "1 1\/2 teaspoons ground cinnamon",
            "1 teaspoon ground nutmeg",
            "1\/2 teaspoon ground ginger",
            "1\/4 teaspoon ground cloves",
            "1 can (16 ounces) pumkin",
            "1 1\/2 cups half-and-half",
            "2 tablespoons unsalted butter, melted",
            "1 teaspoon vanilla extract",
            "1\/2 teaspoon salt",
            "maple cream:",
            "3\/4 cup whipping cream",
            "2 tablespoons powdered sugar",
            "1 tablespoon maple syrup",
            "1 teaspoon vanilla extract"
        ],
        "steps": [
            "Pumpkin Pie with Maple Cream 1 (10-inch) pie; 10 servings",
            "To prepare the crust: Put the flour, sugar and salt in a food processor. Add the pieces of butter and shortening. Pulse for 5 to 10 seconds, until the mixture has the texture of coarse cornmeal. Add the egg yolk, lemon juice or vinegar and ice water. Pulse a few times. Pinch a piece of the dough; if it holds together it's done. Do not allow a dough ball to form on the machine blade, or the pastry will be overworked and tough.",
            "Turn the dough out onto a piece of wax paper. Lift the opposite corners of the paper and press on the dough, forming it into a ball, then press into a 6-inch disk. Wrap the dough and refrigerate 30 minutes.",
            "Heat oven to 425 degrees. Spray a lO-inch pie pan with cooking spray. Roll out the dough on a lightly floured surface or between sheets of lightly floured plastic wrap. Remove wrap and line the pie pan with the dough, trim and flute the edge. Do not pierce the pastry. Chill 30 minutes.",
            "Line the dough with a piece of aluminum foil and add a thin layer of pastry weights. Bake on the center oven rack 12 minutes. Remove the foil and weights; continue baking 5 minutes. Remove from the oven and brush with the egg white. Let coolon a rack.",
            "Prepare the filling: Reduce heat to 400 degrees. Place a baking sheet on the center oven rack. Whisk together the whole eggs, yolk, maple sugar and granulated sugaruntil well blended. Whisk in the cinnamon, nutmeg, ginger, cloves, pumpkin, half-and-half, melted butter, vanilla and salt. Pour into the pie crust and place on baking sheet in the oven. Bake about 50 minutes, or until the top is golden brown and a knife inserted in the center comes out clean. Coolon a wire rack. Refrigerate. Remove about 1 hour before serving.",
            "To prepare the maple cream: Beat the whipping cream with the powdered sugar, maple syrup and vanilla until soft peaks form. Serve a dollop on each slice of pie.",
            "Note: You may substitute 3\/4 cup granulated sugar and 1 tablespoon maple syrup."
        ],
        "comments": []
    },
    {
        "id": 94,
        "user_id": 1,
        "r_name": "Sharp Vinaigrette Dressing\r\n",
        "cat_id": 17,
        "shared": true,
        "rating": 3,
        "category": "Salad",
        "ingredients": [
            "1\/2 cup olive oil",
            "l\/4 cup white wine vinegar",
            "2 tablesp. Dijon mustard",
            "1\/4 teasp. salt",
            "fresh-ground black pepper",
            "2 or 3 large cloves of garlic"
        ],
        "steps": [
            "Usually the best follow-up to a pasta dinner is a green salad. This dressing is refreshing with its sharp bite, but do use fresh garlic.",
            "Combine with vinegar, mustard, salt, pepper and garlic (either minced or pressed). Beat in the olive oil gradually with a fork or a whisk until the mixture emulsifies (becomes cloudy)."
        ],
        "comments": []
    },
    {
        "id": 104,
        "user_id": 1,
        "r_name": "Shredded Pork Tacos",
        "cat_id": 57,
        "shared": true,
        "rating": 3,
        "category": "Mexican",
        "ingredients": [
            "8 taco shells or four 6- to 8-inch flour tortillas 3\/4 cup bottled salsa",
            "2 cups shredded lettuce",
            "1\/2 cup finely shredded anejo enchilado cheese or Monterey Jack cheese (2 ounces)",
            "1\/4 cup sliced pitted ripe olives",
            "Dairy sour cream (optional)",
            "1 medium avocado, halved, seeded, peeled, and chopped"
        ],
        "steps": [
            "Start to Finish: 25 minutesOven: 350°F Makes: 8 tacos 2 cups Shredded Savory Pork",
            "Prepare Shredded Savory Pork. Place taco shells on a baking sheet and heat in a 350° oven for 5 to 7 minutes or until heated through. (Or, wrap tortillas tightly in foil. Heat in a 350° oven about 10 minutes or until heated through.)",
            "Meanwhile, in a medium saucepan combine Shredded Savory Pork and salsa; heat through (add additional salsa, if necessary, to moisten).",
            "To assemble tacos, place pork mixture in warm taco shells. Top with lettuce, cheese, and olives. If desired, serve with sour cream and avocado.ten)."
        ],
        "comments": []
    },
    {
        "id": 101,
        "user_id": 1,
        "r_name": "Tuna Puff Sandwiches",
        "cat_id": 61,
        "shared": false,
        "rating": 1,
        "category": "Sandwiches",
        "ingredients": [
            "1 (7 oz.) can tuna",
            "1 1\/2 teaspoons prepared mustard",
            "1\/2 teaspoon Worcestershire sauce\r\n",
            "1 1\/2 teaspoons grated onion",
            "4 tomato slices",
            "2 English muffins",
            "1\/2 cup finely shredded Cheddar cheese"
        ],
        "steps": [
            "Combine tuna, mustard, Worcestershire, mayonnaise, and onion.",
            "Broil English muffins 4-inches from heat until lightly toasted. Top with tuna mixture, tomato slice, and cheese. Return to broiler until cheese melts. Serves 2-3"
        ],
        "comments": []
    },
    {
        "id": 87,
        "user_id": 1,
        "r_name": "Vegetable-Cheese Lasagna",
        "cat_id": 56,
        "shared": true,
        "rating": 3,
        "category": "Italian",
        "ingredients": [
            "1 tablespoon plus 1 teaspoon margarine",
            "3 cups thinly sliced mushrooms",
            "1 tablespoon plus 1 teaspoon olive oil",
            "1 cup chopped onions",
            "6 garlic cloves, minced",
            "1 1\/2 cups tomato sauce",
            "1 cup canned Italian tomatoes (with liquid); drain and dice tomatoes, reserving liquid",
            "1 1\/2 teaspoons salt, divided",
            "1 teaspoon each oregano leaves and basil leaves",
            "1\/2 teaspoon pepper, divided\r\n1 bay leaf",
            "2 packages (10 ounces each) frozen chopped spinach, thawed and well drained (about 2 cups)",
            "2 cups part-skim ricotta cheese\r\n",
            "1 egg, beaten",
            "8 ounces uncooked lasagna macaroni (12 x 3-inch pieces), cooked according to package directions",
            "11 ounces shredded Monterey Jack cheese, divided"
        ],
        "steps": [
            "In a ten inch skillet heat margarine over medium heat until bubbly and hot; add mushrooms and saute, stirring occasionally, until mushrooms are lightly browned and cooked through, 2 to 3 minutes. Remove from heat and set aside. In 3-quart saucepan heat oil over medium heat; add onions and garlic and saute until onions are softened, 1 to 2 minutes. Add tomato sauce, tomatoes, 3\/4 teaspoon salt, the oregano and basil, Y4 teaspoon pepper, and the bay leaf; mix well. Reduce heat to low, cover, and let simmer, stirring occasionally, for 25 to 30 minutes; remove and discard bay leaf. In medium mixing bowl combine spinach, ricotta cheese, egg, remaining 3\/4 teaspoon salt, and remaining 1\/4 teaspoon pepper, mixing well. ",
            "Preheat oven to 350 degrees. In bottom of 13 x 9 x 2-inch baking dish spread 1\/2 cup tomato mixture; arrange half of the lasagna macaroni lengthwise in dish, overlapping edges slightly. Spread half of the spinach mixture evenly over macaroni and top with half of the mushrooms; spread 1\/2 cup of the tomato mixture over mushrooms and sprinkle with half of the Monterey Jack cheese. Arrange remaining macaroni crosswise in dish, cutting macaroni to fit and overlapping edges slightly. Spread remaining spinach mixture over macaroni, top with remaining mushrooms, tomato mixture, and Monterey Jack cheese. Bake until lasagna is cooked through and cheese is lightly browned, 40 to 50 min"
        ],
        "comments": [
            {
                "comment": "sausage!",
                "user": "John1"
            }
        ]
    },
    {
        "id": 116,
        "user_id": 1,
        "r_name": "Coconut Macaroons ",
        "cat_id": 1,
        "shared": false,
        "rating": 2,
        "category": "Cookies",
        "ingredients": [
            "2\/3 cup all-purpose flour",
            "5 1\/2 cups flaked coconut",
            "1\/4 teaspoon salt",
            "1 (14 ounce) can sweetened condensed milk",
            "2 teaspoons vanilla extract"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil.",
            "In a large bowl, stir together the flour, coconut and salt. Stir in the sweetened condensed milk and vanilla using your hands until well blended.",
            "Use an ice cream scoop to drop dough onto the prepared cookie sheets. Cookies should be about golf ball size.",
            "Bake for 12 to 15 minutes in the preheated oven, until coconut is toasted."
        ],
        "comments": [
            {
                "comment": "This looks really good. I will give it a try soon.",
                "user": "John1"
            }
        ]
    },
    {
        "id": 125,
        "user_id": 1,
        "r_name": "Flank Steak With Kalamata Olives And Feta ",
        "cat_id": 2,
        "shared": false,
        "rating": 2,
        "category": "Meat",
        "ingredients": [
            "Steak and marinade:",
            "1 flank steak (about 1 1\/2 to 2 pounds)",
            "1\/3 cup pitted Kalamata olives",
            "1\/2 teaspoon kosher salt",
            "1\/2 teaspoon coarse-ground black pepper",
            "1 tablespoon minced garlic",
            "2 tablespoons olive oil",
            "1\/4 cup red wine",
            "Toppings:",
            "1\/4 cup pitted Kalamata olives, chopped",
            "1\/3 cup 1\/4-inch-diced white onion",
            "2 tablespoons coarsely chopped Italian parsley",
            "1 teaspoon minced garlic",
            "3 tablespoons extra-virgin olive oil",
            "Kosher salt and pepper to taste",
            "About 1\/2 cup drained, crumbled feta cheese"
        ],
        "steps": [
            "Read recipe all the way through before beginning.",
            "Trim steak of any outer pieces of fat or silver skin. Place the flank steak in a large food-grade, zip-top plastic bad. In a food processor or blender, combine the marinade ingredients and process to a puree. Pour marinade into the plastic bag, then press out any air, seal the bag, and move meat around bag to coat well. Marinate, refrigerated, for a minimum of 1 hour or preferably overnight, turning bag a few times.",
            "Heat coals to hot or medium-hot. Remove steak from marinade and drain well. Discard marinade.",
            "While coals are heating, prepare the topping. Mix olives, onion, parsley, garlic and oil, and sit aside. Have salt, pepper and feta ready.",
            "Sprinkle steak with salt and pepper. Grill meat about 4 minutes per side, for rare, or cook to desired doneness. Length of grilling time per side will vary depending upon heat of grill and thickness of meat. Flank steak will be most tender when grilled to rare of medium-rare.",
            "Let steak sit about 5 minutes before serving, allowing juices to settle. Slice thinly at an angle across the grain. Keeping the slices together; transfer to a clean, warm platter. Spoon any juices onto meat. Stir up reserved topping mixture, and then pour it over the slices. Scatter with feta."
        ],
        "comments": [
            {
                "comment": "yeah - have this set for two stars, but on a nice summer evening with a good bottle of wine ... perhaps more",
                "user": "John1"
            }
        ]
    },
    {
        "id": 75,
        "user_id": 1,
        "r_name": "Lentil Soup",
        "cat_id": 9,
        "shared": false,
        "rating": 1,
        "category": "Soup",
        "ingredients": [
            "2 cans chicken broth",
            "1 can crushed tomatoes",
            "1 bag of lentils",
            "1 cup carrots",
            "1 cup onion",
            "1 cup celery"
        ],
        "steps": [
            "Throw everything in a slow cooker for 8 hours! Mmmmmmmm."
        ],
        "comments": []
    },
    {
        "id": 66,
        "user_id": 1,
        "r_name": "Meat Loaf",
        "cat_id": 2,
        "shared": false,
        "rating": 2,
        "category": "Meat",
        "ingredients": [
            "2 pounds lean ground beef",
            "1\/2 cup rolled oats",
            "1\/2 cup fine dry bread crumbs",
            "1 egg, lightly beaten",
            "1 can condensed French onion soup, undiluted",
            "1\/4 teaspoon salt",
            "1\/4 teaspoon pepper",
            "1 tablespoon dried parsley flakes",
            "ketchup or barbecue sauce, optional"
        ],
        "steps": [
            "This meat loaf is so easy and delicious. Ingredients include condensed French onion soup, quick rolled oats, bread crumbs, and basic seasonings.",
            "Combine all ingredients in a bowl; pack into a meatloaf pan or large (9x5x3-inch) loaf pan. Bake at 350 degrees for about 1 hour and 15 minutes. Spread top with a little barbecue sauce or ketchup about 5 or 10 minutes before done."
        ],
        "comments": [
            {
                "comment": "Well, meatloaf can only have a max of two carrots.",
                "user": "John1"
            }
        ]
    }
]